#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/Accadius/kubernetes-ops-staging-helm-grafana-loki-stack/runs/run-DKwytChVJ62DKuc1

Waiting for the plan to start...

Terraform v1.5.7
on linux_amd64
Initializing plugins and modules...
data.terraform_remote_state.eks: Reading...
data.terraform_remote_state.eks: Read complete after 1s
data.aws_eks_cluster_auth.main: Reading...
data.aws_eks_cluster_auth.main: Read complete after 0s [id=staging]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.loki.helm_release.helm_chart will be created
  + resource "helm_release" "helm_chart" {
      + atomic                     = false
      + chart                      = "loki-stack"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "loki-stack"
      + namespace                  = "monitoring"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://grafana.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                ---
                loki:
                  enabled: true
                
                  # persistence:
                  #   enabled: true
                  #   accessModes:
                  #   - ReadWriteOnce
                  #   size: 20Gi
                
                promtail:
                  enabled: true
                
                  # https://grafana.com/docs/loki/latest/installation/helm/#run-promtail-with-systemd-journal-support
                  extraScrapeConfigs:
                    - job_name: journal
                      journal:
                        path: /var/log/journal
                        max_age: 12h
                        labels:
                          job: systemd-journal
                      relabel_configs:
                        - source_labels: ['__journal__systemd_unit']
                          target_label: 'unit'
                        - source_labels: ['__journal__hostname']
                          target_label: 'hostname'
                
                  # Mount journal directory into promtail pods
                  extraVolumes:
                    - name: journal
                      hostPath:
                        path: /var/log/journal
                
                  extraVolumeMounts:
                    - name: journal
                      mountPath: /var/log/journal
                      readOnly: true
                
                fluent-bit:
                  enabled: false
                
                grafana:
                  enabled: true
            EOT,
          + "",
        ]
      + verify                     = false
      + version                    = "2.9.11"
      + wait                       = true
      + wait_for_jobs              = false
    }

Plan: 1 to add, 0 to change, 0 to destroy.


------------------------------------------------------------------------

Cost estimation:

Resources: 0 of 1 estimated
           $0.0/mo +$0.0

```


</details>

*Pusher: @yaccad, Action: `pull_request`*